torvalds/linux/drivers/net/wireless/rockchip_wlan/rtl8723bu/core/rtw_bt_mp.c
	return 0;
}

u2Byte
mptbt_BtSetMode(
	PADAPTER		Adapter,
	PBT_REQ_CMD 	pBtReq,
	PBT_RSP_CMD 	pBtRsp
	)
{
	u1Byte				h2cParaBuf[6] ={0};
	u1Byte				h2cParaLen=0;
	u2Byte				paraLen=0;
	u1Byte				retStatus=BT_STATUS_BT_OP_SUCCESS;
	u1Byte				btOpcode;
	u1Byte				btOpcodeVer=0;
	u1Byte				btModeToSet=0;

	//
	// check upper layer parameters
	//
	// 1. check upper layer opcode version
	if(pBtReq->opCodeVer != 1)
	{
		DBG_8192C("[MPT], Error!! Upper OP code version not match!!!\n");
		pBtRsp->status = BT_STATUS_OPCODE_U_VERSION_MISMATCH;
		return paraLen;
	}
	// 2. check upper layer parameter length
	if(1 == pBtReq->paraLength)
	{
		btModeToSet = pBtReq->pParamStart[0];
		DBG_8192C("[MPT], BtTestMode=%d \n", btModeToSet);
	}
	else
	{
		DBG_8192C("[MPT], Error!! wrong parameter length=%d (should be 1)\n", pBtReq->paraLength);
		pBtRsp->status = BT_STATUS_PARAMETER_FORMAT_ERROR_U;
		return paraLen;
	}
	
	//
	// execute lower layer opcodes
	//
	
	// 1. fill h2c parameters	
	// check bt mode
	btOpcode = BT_LO_OP_SET_BT_MODE;
	if(btModeToSet >= MP_BT_MODE_MAX)
	{
		pBtRsp->status = BT_STATUS_PARAMETER_OUT_OF_RANGE_U;
		return paraLen;
	}
	else
	{
		mptbt_switch_RF(Adapter, 1);

		h2cParaBuf[0] = btModeToSet;
		h2cParaLen = 1;
		// 2. execute h2c and check respond c2h from bt fw is correct or not
		retStatus = mptbt_BtFwOpCodeProcess(Adapter, btOpcode, btOpcodeVer, &h2cParaBuf[0], h2cParaLen);
	}
	
	// 3. construct respond status code and data.
	if(BT_STATUS_BT_OP_SUCCESS == retStatus)
	{
		pBtRsp->status = BT_STATUS_SUCCESS;
	}
	else
	{
		pBtRsp->status = ((btOpcode<<8)|retStatus);
		DBG_8192C("[MPT], Error!! status code=0x%x \n", pBtRsp->status);
	}
	
	return paraLen;
}


VOID
MPTBT_FwC2hBtMpCtrl(
	PADAPTER	Adapter,
	pu1Byte 	tmpBuf,
	u1Byte		length
	)
{
	u32 i;
	PMPT_CONTEXT	pMptCtx=&(Adapter->mppriv.MptCtx);
	PBT_EXT_C2H pExtC2h=(PBT_EXT_C2H)tmpBuf;
	
	if(Adapter->bBTFWReady == _FALSE || Adapter->registrypriv.mp_mode == 0 )
	{	
		//DBG_8192C("Ignore C2H BT MP Info since not in MP mode \n");
		return;
	}
	if( length > 32 || length < 3 )
	{
		DBG_8192C("\n [MPT], pExtC2h->buf hex: length=%d > 32 || < 3\n",length);
		return;
	}

	//cancel_timeout for h2c handle
	_cancel_timer_ex(&pMptCtx->MPh2c_timeout_timer);

	for (i=0; i<length; i++)
	{
		DBG_8192C("[MPT], %s, buf[%d]=0x%02x ", __FUNCTION__, i, tmpBuf[i]);
	}
	DBG_8192C("[MPT], pExtC2h->extendId=0x%x\n", pExtC2h->extendId);
	
	switch(pExtC2h->extendId)
	{
		case EXT_C2H_WIFI_FW_ACTIVE_RSP:
			DBG_8192C("[MPT], EXT_C2H_WIFI_FW_ACTIVE_RSP\n");
#if 0
			DBG_8192C("[MPT], pExtC2h->buf hex: \n");
			for (i=0; i<(length-3); i++)
			{
				DBG_8192C(" 0x%x ", pExtC2h->buf[i]);
			}
#endif
			if ((_FALSE == pMptCtx->bMPh2c_timeout)
				&& (_FALSE == pMptCtx->MptH2cRspEvent))
			{
				pMptCtx->MptH2cRspEvent = _TRUE;
				_rtw_up_sema(&pMptCtx->MPh2c_Sema);
			}
			break;

		case EXT_C2H_TRIG_BY_BT_FW:
			DBG_8192C("[MPT], EXT_C2H_TRIG_BY_BT_FW\n");
			_rtw_memcpy(&pMptCtx->c2hBuf[0], tmpBuf, length);
			DBG_8192C("[MPT], pExtC2h->statusCode=0x%x\n", pExtC2h->statusCode);
			DBG_8192C("[MPT], pExtC2h->retLen=0x%x\n", pExtC2h->retLen);
			DBG_8192C("[MPT], pExtC2h->opCodeVer=0x%x\n", pExtC2h->opCodeVer);
			DBG_8192C("[MPT], pExtC2h->reqNum=0x%x\n", pExtC2h->reqNum);
			for (i=0; i<(length-3); i++)
			{
				DBG_8192C("[MPT], pExtC2h->buf[%d]=0x%02x\n", i, pExtC2h->buf[i]);
			}

			if ((_FALSE == pMptCtx->bMPh2c_timeout)
				&& (_TRUE == pMptCtx->MptH2cRspEvent)
				&& (_FALSE == pMptCtx->MptBtC2hEvent))
			{
				pMptCtx->MptBtC2hEvent = _TRUE;
				_rtw_up_sema(&pMptCtx->MPh2c_Sema);
			}
			break;

		default:
			DBG_8192C("[MPT], EXT_C2H Target not found,pExtC2h->extendId =%d ,pExtC2h->reqNum=%d\n",pExtC2h->extendId,pExtC2h->reqNum);
			break;
	}
	

	
}


u2Byte
mptbt_BtGetGeneral(
	IN	PADAPTER		Adapter,
	IN	PBT_REQ_CMD 	pBtReq,
	IN	PBT_RSP_CMD 	pBtRsp
	)
{
	PMPT_CONTEXT		pMptCtx=&(Adapter->mppriv.MptCtx);
	PBT_EXT_C2H 		pExtC2h=(PBT_EXT_C2H)&pMptCtx->c2hBuf[0];
	u1Byte				h2cParaBuf[6] ={0};
	u1Byte				h2cParaLen=0;
	u2Byte				paraLen=0;
	u1Byte				retStatus=BT_STATUS_BT_OP_SUCCESS;
	u1Byte				btOpcode, bdAddr[6]={0};
	u1Byte				btOpcodeVer=0;
	u1Byte				getType=0, i;
	u2Byte				getParaLen=0, validParaLen=0;
	u1Byte				regType=0, reportType=0;
	u4Byte				regAddr=0, regValue=0;
	pu4Byte 			pu4Tmp;
	pu2Byte 			pu2Tmp;
	pu1Byte 			pu1Tmp;

	//
	// check upper layer parameters
	//
	
	// check upper layer opcode version
	if(pBtReq->opCodeVer != 1)
	{
		DBG_8192C("[MPT], Error!! Upper OP code version not match!!!\n");
		pBtRsp->status = BT_STATUS_OPCODE_U_VERSION_MISMATCH;
		return paraLen;
	}
	// check upper layer parameter length
	if(pBtReq->paraLength < 1)
	{
		DBG_8192C("[MPT], Error!! wrong parameter length=%d (should larger than 1)\n", pBtReq->paraLength);
		pBtRsp->status = BT_STATUS_PARAMETER_FORMAT_ERROR_U;
		return paraLen;
	}
	getParaLen = pBtReq->paraLength - 1;
	getType = pBtReq->pParamStart[0];
	
	DBG_8192C("[MPT], getType=%d, getParaLen=%d\n", getType, getParaLen);

	// check parameter first
	switch(getType)
	{
		case BT_GGET_REG:
			DBG_8192C("[MPT], [BT_GGET_REG]\n");
			validParaLen = 5;
			if(getParaLen == validParaLen)
			{
				btOpcode = BT_LO_OP_READ_REG;
				regType = pBtReq->pParamStart[1];
				pu4Tmp = (pu4Byte)&pBtReq->pParamStart[2];
				regAddr = *pu4Tmp;
				DBG_8192C("[MPT], BT_GGET_REG regType=0x%02x, regAddr=0x%08x!!\n",
					regType, regAddr);
				if(regType >= BT_REG_MAX)
				{
					pBtRsp->status = (btOpcode<<8)| BT_STATUS_PARAMETER_OUT_OF_RANGE_U;
					return paraLen;
				}
				else
				{
					if( ((BT_REG_RF==regType)&&(regAddr>0x7f)) ||
						((BT_REG_MODEM==regType)&&(regAddr>0x1ff)) ||
						((BT_REG_BLUEWIZE==regType)&&(regAddr>0xfff)) ||
						((BT_REG_VENDOR==regType)&&(regAddr>0xfff)) ||
						((BT_REG_LE==regType)&&(regAddr>0xfff)) )
					{				
						pBtRsp->status = (btOpcode<<8)| BT_STATUS_PARAMETER_OUT_OF_RANGE_U;
						return paraLen;
					}
				}
			}
			break;
		case BT_GGET_STATUS:
			DBG_8192C("[MPT], [BT_GGET_STATUS]\n");
			validParaLen = 0;
			break;
		case BT_GGET_REPORT:
			DBG_8192C("[MPT], [BT_GGET_REPORT]\n");
			validParaLen = 1;
			if(getParaLen == validParaLen)
			{
				reportType = pBtReq->pParamStart[1];
				DBG_8192C("[MPT], BT_GGET_REPORT reportType=0x%x!!\n", reportType);
				if(reportType >= BT_REPORT_MAX)
				{
					pBtRsp->status = BT_STATUS_PARAMETER_OUT_OF_RANGE_U;
					return paraLen;
				}
			}
			break;
		default:
			{
				DBG_8192C("[MPT], Error!! getType=%d, out of range\n", getType);
				pBtRsp->status = BT_STATUS_PARAMETER_OUT_OF_RANGE_U;
				return paraLen;
			}
			break;
	}
	if(getParaLen != validParaLen)
	{
		DBG_8192C("[MPT], Error!! wrong parameter length=%d for BT_GET_GEN_CMD cmd id=0x%x, paraLen should=0x%x\n",
			getParaLen, getType, validParaLen);
		pBtRsp->status = BT_STATUS_PARAMETER_FORMAT_ERROR_U;
		return paraLen;
	}
	
	//
	// execute lower layer opcodes
	//
	if(BT_GGET_REG == getType)
	{
		// fill h2c parameters
		// here we should write reg value first then write the address, adviced by Austin
		btOpcode = BT_LO_OP_READ_REG;
		h2cParaBuf[0] = regType;
		h2cParaBuf[1] = pBtReq->pParamStart[2];
		h2cParaBuf[2] = pBtReq->pParamStart[3];
		h2cParaLen = 3;
		// execute h2c and check respond c2h from bt fw is correct or not
		retStatus = mptbt_BtFwOpCodeProcess(Adapter, btOpcode, btOpcodeVer, &h2cParaBuf[0], h2cParaLen);
		// construct respond status code and data.
		if(BT_STATUS_BT_OP_SUCCESS != retStatus)
		{
			pBtRsp->status = ((btOpcode<<8)|retStatus);
			DBG_8192C("[MPT], Error!! status code=0x%x \n", pBtRsp->status);
			return paraLen;
		}

		pu2Tmp = (pu2Byte)&pExtC2h->buf[0];
		regValue = *pu2Tmp;
		DBG_8192C("[MPT], read reg regType=0x%02x, regAddr=0x%08x, regValue=0x%04x\n", 
			regType, regAddr, regValue);
		
		pu4Tmp = (pu4Byte)&pBtRsp->pParamStart[0];
		*pu4Tmp = regValue;
		paraLen = 4;
	}
	else if(BT_GGET_STATUS == getType)
	{
		btOpcode = BT_LO_OP_GET_BT_STATUS;
		h2cParaLen = 0;
		// execute h2c and check respond c2h from bt fw is correct or not
		retStatus = mptbt_BtFwOpCodeProcess(Adapter, btOpcode, btOpcodeVer, &h2cParaBuf[0], h2cParaLen);
		// construct respond status code and data.
		if(BT_STATUS_BT_OP_SUCCESS != retStatus)
		{
			pBtRsp->status = ((btOpcode<<8)|retStatus);
			DBG_8192C("[MPT], Error!! status code=0x%x \n", pBtRsp->status);
			return paraLen;
		}

