torvalds/linux/drivers/net/wireless/rockchip_wlan/rtl8723bu/core/rtw_bt_mp.c
	btOpcode = BT_LO_OP_SET_BD_ADDR_H;
	{
		h2cParaBuf[0] = pTxRxPars->txrxBdaddr[3];
		h2cParaBuf[1] = pTxRxPars->txrxBdaddr[4];
		h2cParaBuf[2] = pTxRxPars->txrxBdaddr[5];
		h2cParaLen = 3;
		retStatus = mptbt_BtFwOpCodeProcess(Adapter, btOpcode, btOpcodeVer, &h2cParaBuf[0], h2cParaLen);
	}
	// ckeck bt return status.
	if(BT_STATUS_BT_OP_SUCCESS != retStatus)
	{
		pBtRsp->status = ((btOpcode<<8)|retStatus);
		DBG_8192C  ("[MPT], Error!! status code=0x%x \n", pBtRsp->status);
		return paraLen;
	}

	pBtRsp->status = BT_STATUS_SUCCESS;
	return paraLen;
}



u2Byte
mptbt_BtTestCtrl(
	IN	PADAPTER		Adapter,
	IN	PBT_REQ_CMD 	pBtReq,
	IN	PBT_RSP_CMD 	pBtRsp
	)
{
	u1Byte				h2cParaBuf[6] ={0};
	u1Byte				h2cParaLen=0;
	u2Byte				paraLen=0;
	u1Byte				retStatus=BT_STATUS_BT_OP_SUCCESS;
	u1Byte				btOpcode;
	u1Byte				btOpcodeVer=0;
	u1Byte				testCtrl=0;

	//
	// check upper layer parameters
	//
	
	// 1. check upper layer opcode version
	if(pBtReq->opCodeVer != 1)
	{
		DBG_8192C("[MPT], Error!! Upper OP code version not match!!!\n");
		pBtRsp->status = BT_STATUS_OPCODE_U_VERSION_MISMATCH;
		return paraLen;
	}
	// 2. check upper layer parameter length
	if(1 == pBtReq->paraLength)
	{
		testCtrl = pBtReq->pParamStart[0];
		DBG_8192C("[MPT], testCtrl=%d \n", testCtrl);
	}
	else
	{
		DBG_8192C("[MPT], Error!! wrong parameter length=%d (should be 1)\n", pBtReq->paraLength);
		pBtRsp->status = BT_STATUS_PARAMETER_FORMAT_ERROR_U;
		return paraLen;
	}
	
	//
	// execute lower layer opcodes
	//
	
	// 1. fill h2c parameters	
	// check bt mode
	btOpcode = BT_LO_OP_TEST_CTRL;
	if(testCtrl >= MP_BT_TEST_MAX)
	{
		DBG_8192C("[MPT], Error!! testCtrl=0x%x, (should be between smaller or equal to 0x%x)\n", 
			testCtrl, MP_BT_TEST_MAX-1);
		pBtRsp->status = BT_STATUS_PARAMETER_OUT_OF_RANGE_U;
		return paraLen;
	}
	else
	{
		h2cParaBuf[0] = testCtrl;
		h2cParaLen = 1;
		retStatus = mptbt_BtFwOpCodeProcess(Adapter, btOpcode, btOpcodeVer, &h2cParaBuf[0], h2cParaLen);
	}
	
	// 3. construct respond status code and data.
	if(BT_STATUS_BT_OP_SUCCESS != retStatus)
	{
		pBtRsp->status = ((btOpcode<<8)|retStatus);
		DBG_8192C("[MPT], Error!! status code=0x%x \n", pBtRsp->status);
		return paraLen;
	}

	pBtRsp->status = BT_STATUS_SUCCESS;
	return paraLen;
}


u2Byte
mptbt_TestBT(
	IN	PADAPTER		Adapter,
	IN	PBT_REQ_CMD 	pBtReq,
	IN	PBT_RSP_CMD 	pBtRsp
	)
{

	u1Byte				h2cParaBuf[6] ={0};
	u1Byte				h2cParaLen=0;
	u2Byte				paraLen=0;
	u1Byte				retStatus=BT_STATUS_BT_OP_SUCCESS;
	u1Byte				btOpcode;
	u1Byte				btOpcodeVer=0;
	u1Byte				testCtrl=0;

	// 1. fill h2c parameters	
		btOpcode =  0x11;
		h2cParaBuf[0] = 0x11;
		h2cParaBuf[1] = 0x0;
		h2cParaBuf[2] = 0x0;
		h2cParaBuf[3] = 0x0;
		h2cParaBuf[4] = 0x0;
		h2cParaLen = 1;
	//	retStatus = mptbt_BtFwOpCodeProcess(Adapter, btOpcode, btOpcodeVer, &h2cParaBuf[0], h2cParaLen);
		retStatus = mptbt_BtFwOpCodeProcess(Adapter, btOpcode, btOpcodeVer, h2cParaBuf, h2cParaLen);
	
	
	// 3. construct respond status code and data.
	if(BT_STATUS_BT_OP_SUCCESS != retStatus)
	{
		pBtRsp->status = ((btOpcode<<8)|retStatus);
		DBG_8192C("[MPT], Error!! status code=0x%x \n", pBtRsp->status);
		return paraLen;
	}

	pBtRsp->status = BT_STATUS_SUCCESS;
	return paraLen;
}

VOID
mptbt_BtControlProcess(
	PADAPTER	Adapter,
	PVOID		pInBuf
	)
{
	u1Byte			H2C_Parameter[6] ={0};
	PBT_H2C 		pH2c=(PBT_H2C)&H2C_Parameter[0];
	PMPT_CONTEXT	pMptCtx=&(Adapter->mppriv.MptCtx);
	PBT_REQ_CMD 	pBtReq=(PBT_REQ_CMD)pInBuf;
	PBT_RSP_CMD 	pBtRsp;
	u1Byte			i;


	DBG_8192C("[MPT], mptbt_BtControlProcess()=========>\n");

	DBG_8192C("[MPT], input opCodeVer=%d\n", pBtReq->opCodeVer);
	DBG_8192C("[MPT], input OpCode=%d\n", pBtReq->OpCode);
	DBG_8192C("[MPT], paraLength=%d \n", pBtReq->paraLength);
	if(pBtReq->paraLength)
	{
		//DBG_8192C("[MPT], parameters(hex):0x%x %d \n",&pBtReq->pParamStart[0], pBtReq->paraLength);
	}

	_rtw_memset((void*)pMptCtx->mptOutBuf, 0, 100);
	pMptCtx->mptOutLen = 4; //length of (BT_RSP_CMD.status+BT_RSP_CMD.paraLength)

	pBtRsp = (PBT_RSP_CMD)pMptCtx->mptOutBuf;
	pBtRsp->status = BT_STATUS_SUCCESS;
	pBtRsp->paraLength = 0x0;

	// The following we should maintain the User OP codes sent by upper layer
	switch(pBtReq->OpCode)
	{
		case BT_UP_OP_BT_READY:
			DBG_8192C("[MPT], OPcode : [BT_READY]\n");
			pBtRsp->paraLength = mptbt_BtReady(Adapter, pBtReq, pBtRsp);
			break;
		case BT_UP_OP_BT_SET_MODE:
			DBG_8192C("[MPT], OPcode : [BT_SET_MODE]\n");
			pBtRsp->paraLength = mptbt_BtSetMode(Adapter, pBtReq, pBtRsp);
			break;
		case BT_UP_OP_BT_SET_TX_RX_PARAMETER:
			DBG_8192C("[MPT], OPcode : [BT_SET_TXRX_PARAMETER]\n");
			pBtRsp->paraLength = mptbt_BtSetTxRxPars(Adapter, pBtReq, pBtRsp);
			break;
		case BT_UP_OP_BT_SET_GENERAL:
			DBG_8192C("[MPT], OPcode : [BT_SET_GENERAL]\n");
			pBtRsp->paraLength = mptbt_BtSetGeneral(Adapter, pBtReq, pBtRsp);
			break;
		case BT_UP_OP_BT_GET_GENERAL:
			DBG_8192C("[MPT], OPcode : [BT_GET_GENERAL]\n");
			pBtRsp->paraLength = mptbt_BtGetGeneral(Adapter, pBtReq, pBtRsp);
			break;
		case BT_UP_OP_BT_TEST_CTRL:
			DBG_8192C("[MPT], OPcode : [BT_TEST_CTRL]\n");
			pBtRsp->paraLength = mptbt_BtTestCtrl(Adapter, pBtReq, pBtRsp);
			break;
		case BT_UP_OP_TEST_BT:
			DBG_8192C("[MPT], OPcode : [TEST_BT]\n");
			pBtRsp->paraLength = mptbt_TestBT(Adapter, pBtReq, pBtRsp);
			break;
		default:
			DBG_8192C("[MPT], Error!! OPcode : UNDEFINED!!!!\n");
			pBtRsp->status = BT_STATUS_UNKNOWN_OPCODE_U;
			pBtRsp->paraLength = 0x0;
			break;
	}

	pMptCtx->mptOutLen += pBtRsp->paraLength;

	DBG_8192C("[MPT], pMptCtx->mptOutLen=%d, pBtRsp->paraLength=%d\n", pMptCtx->mptOutLen, pBtRsp->paraLength);
	DBG_8192C("[MPT], mptbt_BtControlProcess()<=========\n");
}

#endif

